app/controllers/confirmations_controller.rb

	def show
		user = User.find_by(codigo_confirmacao: params[:token])
---
SELECT  "users".* FROM "users" WHERE "users"."codigo_confirmacao" = ? LIMIT 1  [["codigo_confirmacao", "T92fMbSlGN6XaPMFdiZBHA"]]