app/controllers/rooms_controller.rb

  def index
    @rooms = Room.most_recent.map do |room|
---
SELECT  "rooms".* FROM "rooms"  ORDER BY "rooms"."id" DESC LIMIT 1

  def create
    @room = current_user.rooms.build(room_params)

      if @room.save
---
INSERT INTO "rooms" ("title", "location", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Quarto do TDC"], ["location", "Floripa"], ["description", "só cachacero"], ["user_id", 10], ["created_at", "2015-05-13 22:41:32.514614"], ["updated_at", "2015-05-13 22:41:32.514614"]]

  def update

      if @room.update(room_params)
---
UPDATE "rooms" SET "title" = ?, "updated_at" = ? WHERE "rooms"."id" = ?  [["title", "Quarto de loco"], ["updated_at", "2015-04-30 04:48:08.886559"], ["id", 1]]

  def destroy
    @room.destroy
---
DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 2]]

    def set_room
      room_model = Room.find(params[:id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", 2]]

    def set_users_room
      @room = current_user.rooms.find(params[:id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."user_id" = ? AND "rooms"."id" = ? LIMIT 1  [["user_id", 10], ["id", 4]]