app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO "users" ("email", "full_name", "location", "password_digest", "bio", "created_at", "updated_at", "codigo_confirmacao") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

	def update
		@user = User.find(params[:id])
		if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "bio" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["bio", "muito legal"], ["updated_at", "2015-04-28 05:28:15.312608"], ["id", 1]]