app/controllers/rooms/reviews_controller.rb

	def create
		review = room.reviews.
		  find_or_initialize_by(user_id: current_user.id)

		review.update!(review_params)
---
UPDATE "rooms" SET "reviews_count" = COALESCE("reviews_count", 0) + 1 WHERE "rooms"."id" = ?  [["id", 3]]